class Printer

  def initialize

  end

  def rezult(user_input, word_array, good_letters)
      print "Само слово: "
      word_array.each do |letter|
        if good_letters.include?(letter)
          print " #{letter} "
        else
          print " _ "
        end
      end
  end
end

# Проблема в том, что теперь в число хороших букв попадают и те, которых в
# исходном слове не было (Для слова "ёж" good_letters = ["ё", "е", "ж"])
# и буква слова не может не быть найдена в массиве хороших букв
# (например было введено "е" и "ж" - good_letters = ["е", "ж"])
# значит проверка должна быть иной: должен быть создан отдельный массив
# в котором будут все возможные верные буквы слова. Теперь перед выводом
# на экран надо проверять каждую букву на вхождение в оба массива
